## Plan Result (1112: sbox_aria - Terraform Plan Apply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 24 to change, 3 to destroy.</code></pre>

* Create
  * local_file.config[&#34;00&#34;]
  * local_file.config[&#34;01&#34;]
  * local_file.config[&#34;02&#34;]
* Update
  * azurerm_key_vault_secret.client_secret[&#34;00&#34;]
  * azurerm_key_vault_secret.client_secret[&#34;01&#34;]
  * azurerm_key_vault_secret.client_secret[&#34;02&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-td&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-td&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-td&#34;]
* Delete
  * azurerm_key_vault_secret.curated_sas_token_test[&#34;00&#34;]
  * azurerm_key_vault_secret.curated_sas_token_test[&#34;01&#34;]
  * azurerm_key_vault_secret.curated_sas_token_test[&#34;02&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.client_secret["00"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "client_secret" {
        id                      = "https://ingest00-meta002-sbox.vault.azure.net/secrets/SERVICE-PRINCIPLE-CLIENT-SECRET/a5435b10a2424061bc86591cf9716616"
        name                    = "SERVICE-PRINCIPLE-CLIENT-SECRET"
        tags                    = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      ~ value                   = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.client_secret["01"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "client_secret" {
        id                      = "https://ingest01-meta002-sbox.vault.azure.net/secrets/SERVICE-PRINCIPLE-CLIENT-SECRET/0002f92db16242e3839905fbb57e7409"
        name                    = "SERVICE-PRINCIPLE-CLIENT-SECRET"
        tags                    = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      ~ value                   = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.client_secret["02"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "client_secret" {
        id                      = "https://ingest02-meta002-sbox.vault.azure.net/secrets/SERVICE-PRINCIPLE-CLIENT-SECRET/d264c09e4cc741bc9cc8e3f67cdc20ce"
        name                    = "SERVICE-PRINCIPLE-CLIENT-SECRET"
        tags                    = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      ~ value                   = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.curated_sas_token_test["00"] will be destroyed
  # (because azurerm_key_vault_secret.curated_sas_token_test is not in configuration)
  - resource "azurerm_key_vault_secret" "curated_sas_token_test" {
      - id                      = "https://ingest00-meta002-sbox.vault.azure.net/secrets/CURATED-sbox-SAS-TOKEN-TEST/7a3615d697734876905afa2cf01698e2" -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox" -> null
      - name                    = "CURATED-SBOX-SAS-TOKEN-TEST" -> null
      - resource_id             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/secrets/CURATED-sbox-SAS-TOKEN-TEST/versions/7a3615d697734876905afa2cf01698e2" -> null
      - resource_versionless_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/secrets/CURATED-sbox-SAS-TOKEN-TEST" -> null
      - tags                    = {
          - "file-encoding" = "utf-8"
        } -> null
      - value                   = (sensitive value) -> null
      - value_wo                = (write-only attribute) -> null
      - value_wo_version        = 0 -> null
      - version                 = "7c2c0bf067414ae4a2e9a7a35d0dd2bc" -> null
      - versionless_id          = "https://ingest00-meta002-sbox.vault.azure.net/secrets/CURATED-sbox-SAS-TOKEN-TEST" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.curated_sas_token_test["01"] will be destroyed
  # (because azurerm_key_vault_secret.curated_sas_token_test is not in configuration)
  - resource "azurerm_key_vault_secret" "curated_sas_token_test" {
      - id                      = "https://ingest01-meta002-sbox.vault.azure.net/secrets/CURATED-sbox-SAS-TOKEN-TEST/3a8d350ec1a2411793695313aa6c7ca5" -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.KeyVault/vaults/ingest01-meta002-sbox" -> null
      - name                    = "CURATED-SBOX-SAS-TOKEN-TEST" -> null
      - resource_id             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.KeyVault/vaults/ingest01-meta002-sbox/secrets/CURATED-sbox-SAS-TOKEN-TEST/versions/3a8d350ec1a2411793695313aa6c7ca5" -> null
      - resource_versionless_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.KeyVault/vaults/ingest01-meta002-sbox/secrets/CURATED-sbox-SAS-TOKEN-TEST" -> null
      - tags                    = {
          - "file-encoding" = "utf-8"
        } -> null
      - value                   = (sensitive value) -> null
      - value_wo                = (write-only attribute) -> null
      - value_wo_version        = 0 -> null
      - version                 = "a71d27af70fa42deb29761c720c69c7a" -> null
      - versionless_id          = "https://ingest01-meta002-sbox.vault.azure.net/secrets/CURATED-sbox-SAS-TOKEN-TEST" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.curated_sas_token_test["02"] will be destroyed
  # (because azurerm_key_vault_secret.curated_sas_token_test is not in configuration)
  - resource "azurerm_key_vault_secret" "curated_sas_token_test" {
      - id                      = "https://ingest02-meta002-sbox.vault.azure.net/secrets/CURATED-sbox-SAS-TOKEN-TEST/1f5151a332894f258bd25676d254124c" -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.KeyVault/vaults/ingest02-meta002-sbox" -> null
      - name                    = "CURATED-SBOX-SAS-TOKEN-TEST" -> null
      - resource_id             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.KeyVault/vaults/ingest02-meta002-sbox/secrets/CURATED-sbox-SAS-TOKEN-TEST/versions/1f5151a332894f258bd25676d254124c" -> null
      - resource_versionless_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.KeyVault/vaults/ingest02-meta002-sbox/secrets/CURATED-sbox-SAS-TOKEN-TEST" -> null
      - tags                    = {
          - "file-encoding" = "utf-8"
        } -> null
      - value                   = (sensitive value) -> null
      - value_wo                = (write-only attribute) -> null
      - value_wo_version        = 0 -> null
      - version                 = "fa335c153af34946806e953bf3e69a00" -> null
      - versionless_id          = "https://ingest02-meta002-sbox.vault.azure.net/secrets/CURATED-sbox-SAS-TOKEN-TEST" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_linux_function_app.example["00-af-aplfpa"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (11 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-aplfpa-sbox00-uks-dlrm-01"
        name                                           = "af-aplfpa-sbox00-uks-dlrm-01"
      ~ tags                                           = {
            "application"                                    = "dlrm-data-ingest"
            "builtFrom"                                      = "hmcts/dlrm-data-ingest-aria"
            "businessArea"                                   = "cross-cutting"
            "criticality"                                    = "Low"
            "environment"                                    = "sandbox"
            "expiresAfter"                                   = "3000-01-01"
          - "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=4c58b093-3e39-4660-bffe-82573b33953a;IngestionEndpoint=https://uksouth-1.in.applicationinsights.azure.com/;LiveEndpoint=https://uksouth.livediagnostics.monitor.azure.com/;ApplicationId=2a308a8f-e050-4295-ae0f-57af0c9b7b8a" -> null
          - "hidden-link: /app-insights-instrumentation-key" = "4c58b093-3e39-4660-bffe-82573b33953a" -> null
          - "hidden-link: /app-insights-resource-id"         = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/microsoft.insights/components/af-aplfpa-sbox00-uks-dlrm-01" -> null
        }
      ~ virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-product-001-sbox" -> "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-bricks-product-private-sbox"
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-aplfta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (11 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-aplfta-sbox00-uks-dlrm-01"
        name                                           = "af-aplfta-sbox00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      ~ virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-product-001-sbox" -> "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-bricks-product-private-sbox"
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-apluta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (11 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-apluta-sbox00-uks-dlrm-01"
        name                                           = "af-apluta-sbox00-uks-dlrm-01"
      ~ tags                                           = {
            "application"                                    = "dlrm-data-ingest"
            "builtFrom"                                      = "hmcts/dlrm-data-ingest-aria"
            "businessArea"                                   = "cross-cutting"
            "criticality"                                    = "Low"
            "environment"                                    = "sandbox"
            "expiresAfter"                                   = "3000-01-01"
          - "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=62709f92-4a4b-469b-af06-0b9712baf4fc;IngestionEndpoint=https://uksouth-1.in.applicationinsights.azure.com/;LiveEndpoint=https://uksouth.livediagnostics.monitor.azure.com/;ApplicationId=c47c04a2-dcf0-46a3-887a-d24ffb544c24" -> null
          - "hidden-link: /app-insights-instrumentation-key" = "62709f92-4a4b-469b-af06-0b9712baf4fc" -> null
          - "hidden-link: /app-insights-resource-id"         = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/microsoft.insights/components/af-apluta-sbox00-uks-dlrm-01" -> null
        }
      ~ virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-product-001-sbox" -> "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-bricks-product-private-sbox"
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-bails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (11 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-bails-sbox00-uks-dlrm-01"
        name                                           = "af-bails-sbox00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      ~ virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-product-001-sbox" -> "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-bricks-product-private-sbox"
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-joh"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (11 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-joh-sbox00-uks-dlrm-01"
        name                                           = "af-joh-sbox00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      ~ virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-product-001-sbox" -> "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-bricks-product-private-sbox"
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-sbails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (11 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-sbails-sbox00-uks-dlrm-01"
        name                                           = "af-sbails-sbox00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      ~ virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-product-001-sbox" -> "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-bricks-product-private-sbox"
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-td"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (11 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-td-sbox00-uks-dlrm-01"
        name                                           = "af-td-sbox00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      ~ virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-product-001-sbox" -> "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-bricks-product-private-sbox"
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-aplfpa"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (11 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-aplfpa-sbox01-uks-dlrm-01"
        name                                           = "af-aplfpa-sbox01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      ~ virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest01-vnet-sbox/subnets/ingest01-data-product-001-sbox" -> "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest01-vnet-sbox/subnets/ingest01-data-bricks-product-private-sbox"
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-aplfta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (11 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-aplfta-sbox01-uks-dlrm-01"
        name                                           = "af-aplfta-sbox01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      ~ virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest01-vnet-sbox/subnets/ingest01-data-product-001-sbox" -> "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest01-vnet-sbox/subnets/ingest01-data-bricks-product-private-sbox"
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-apluta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (11 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-apluta-sbox01-uks-dlrm-01"
        name                                           = "af-apluta-sbox01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      ~ virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest01-vnet-sbox/subnets/ingest01-data-product-001-sbox" -> "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest01-vnet-sbox/subnets/ingest01-data-bricks-product-private-sbox"
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-bails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (11 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-bails-sbox01-uks-dlrm-01"
        name                                           = "af-bails-sbox01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      ~ virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest01-vnet-sbox/subnets/ingest01-data-product-001-sbox" -> "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest01-vnet-sbox/subnets/ingest01-data-bricks-product-private-sbox"
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-joh"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (11 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-joh-sbox01-uks-dlrm-01"
        name                                           = "af-joh-sbox01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      ~ virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest01-vnet-sbox/subnets/ingest01-data-product-001-sbox" -> "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest01-vnet-sbox/subnets/ingest01-data-bricks-product-private-sbox"
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-sbails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (11 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-sbails-sbox01-uks-dlrm-01"
        name                                           = "af-sbails-sbox01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      ~ virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest01-vnet-sbox/subnets/ingest01-data-product-001-sbox" -> "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest01-vnet-sbox/subnets/ingest01-data-bricks-product-private-sbox"
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-td"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (11 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-td-sbox01-uks-dlrm-01"
        name                                           = "af-td-sbox01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      ~ virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest01-vnet-sbox/subnets/ingest01-data-product-001-sbox" -> "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest01-vnet-sbox/subnets/ingest01-data-bricks-product-private-sbox"
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["02-af-aplfpa"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (11 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-aplfpa-sbox02-uks-dlrm-01"
        name                                           = "af-aplfpa-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      ~ virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest02-vnet-sbox/subnets/ingest02-data-product-001-sbox" -> "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest02-vnet-sbox/subnets/ingest02-data-bricks-product-private-sbox"
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["02-af-aplfta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (11 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-aplfta-sbox02-uks-dlrm-01"
        name                                           = "af-aplfta-sbox02-uks-dlrm-01"
      ~ tags                                           = {
            "application"                                    = "dlrm-data-ingest"
            "builtFrom"                                      = "hmcts/dlrm-data-ingest-aria"
            "businessArea"                                   = "cross-cutting"
            "criticality"                                    = "Low"
            "environment"                                    = "sandbox"
            "expiresAfter"                                   = "3000-01-01"
          - "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=1fa47655-409e-4e4a-bf50-be0f21811dc8;IngestionEndpoint=https://uksouth-1.in.applicationinsights.azure.com/;LiveEndpoint=https://uksouth.livediagnostics.monitor.azure.com/;ApplicationId=98545325-b55a-40d8-b3b7-eb6c4ecf2c01" -> null
          - "hidden-link: /app-insights-instrumentation-key" = "1fa47655-409e-4e4a-bf50-be0f21811dc8" -> null
          - "hidden-link: /app-insights-resource-id"         = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/microsoft.insights/components/af-aplfta-sbox02-uks-dlrm-01" -> null
        }
      ~ virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest02-vnet-sbox/subnets/ingest02-data-product-001-sbox" -> "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest02-vnet-sbox/subnets/ingest02-data-bricks-product-private-sbox"
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["02-af-apluta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (11 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-apluta-sbox02-uks-dlrm-01"
        name                                           = "af-apluta-sbox02-uks-dlrm-01"
      ~ tags                                           = {
            "application"                                    = "dlrm-data-ingest"
            "builtFrom"                                      = "hmcts/dlrm-data-ingest-aria"
            "businessArea"                                   = "cross-cutting"
            "criticality"                                    = "Low"
            "environment"                                    = "sandbox"
            "expiresAfter"                                   = "3000-01-01"
          - "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=c67c5da2-8a41-4987-aa84-3d5244f92f09;IngestionEndpoint=https://uksouth-1.in.applicationinsights.azure.com/;LiveEndpoint=https://uksouth.livediagnostics.monitor.azure.com/;ApplicationId=49c3648f-9e73-48b3-9957-50c46fac0f7a" -> null
          - "hidden-link: /app-insights-instrumentation-key" = "c67c5da2-8a41-4987-aa84-3d5244f92f09" -> null
          - "hidden-link: /app-insights-resource-id"         = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/microsoft.insights/components/af-apluta-sbox02-uks-dlrm-01" -> null
        }
      ~ virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest02-vnet-sbox/subnets/ingest02-data-product-001-sbox" -> "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest02-vnet-sbox/subnets/ingest02-data-bricks-product-private-sbox"
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["02-af-bails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (11 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-bails-sbox02-uks-dlrm-01"
        name                                           = "af-bails-sbox02-uks-dlrm-01"
      ~ tags                                           = {
            "application"                                    = "dlrm-data-ingest"
            "builtFrom"                                      = "hmcts/dlrm-data-ingest-aria"
            "businessArea"                                   = "cross-cutting"
            "criticality"                                    = "Low"
            "environment"                                    = "sandbox"
            "expiresAfter"                                   = "3000-01-01"
          - "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=c60b133c-b89a-466a-b295-71513541d813;IngestionEndpoint=https://uksouth-1.in.applicationinsights.azure.com/;LiveEndpoint=https://uksouth.livediagnostics.monitor.azure.com/;ApplicationId=f11668d1-27e9-49e4-a04f-301ce7cc89f3" -> null
          - "hidden-link: /app-insights-instrumentation-key" = "c60b133c-b89a-466a-b295-71513541d813" -> null
          - "hidden-link: /app-insights-resource-id"         = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/microsoft.insights/components/af-bails-sbox02-uks-dlrm-01" -> null
        }
      ~ virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest02-vnet-sbox/subnets/ingest02-data-product-001-sbox" -> "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest02-vnet-sbox/subnets/ingest02-data-bricks-product-private-sbox"
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["02-af-joh"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (11 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-joh-sbox02-uks-dlrm-01"
        name                                           = "af-joh-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      ~ virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest02-vnet-sbox/subnets/ingest02-data-product-001-sbox" -> "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest02-vnet-sbox/subnets/ingest02-data-bricks-product-private-sbox"
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["02-af-sbails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (11 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-sbails-sbox02-uks-dlrm-01"
        name                                           = "af-sbails-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      ~ virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest02-vnet-sbox/subnets/ingest02-data-product-001-sbox" -> "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest02-vnet-sbox/subnets/ingest02-data-bricks-product-private-sbox"
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["02-af-td"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (11 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-td-sbox02-uks-dlrm-01"
        name                                           = "af-td-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      ~ virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest02-vnet-sbox/subnets/ingest02-data-product-001-sbox" -> "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest02-vnet-sbox/subnets/ingest02-data-bricks-product-private-sbox"
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # local_file.config["00"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "00"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_00.json"
      + id                   = (known after apply)
    }

  # local_file.config["01"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "01"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_01.json"
      + id                   = (known after apply)
    }

  # local_file.config["02"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "02"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_02.json"
      + id                   = (known after apply)
    }

Plan: 3 to add, 24 to change, 3 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":96,"Program":"tfcmt","SHA1":"","Target":"1112: sbox_aria - Terraform Plan Apply","Vars":{}} -->